doc/Testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Testing</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-15 10:04:14 HST"/>
<meta name="author" content="Russellvea"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Testing</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Testing </a></li>
<li><a href="#sec-2">2 Results </a>
<ul>
<li><a href="#sec-2.1">2.1 Karate.net </a></li>
<li><a href="#sec-2.2">2.2 c-elegans.net </a></li>
<li><a href="#sec-2.3">2.3 Artificial-00-mixing.net </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Testing </h2>
<div class="outline-text-2" id="text-1">


<p>
I've implemented Palla et al.'s k-clique algorithm using Bron-Kerbosch clique-detection.
The wikipedia site, recommnded by Dr Suthers, features a runthrough of the algorithm on a small graph.
</p>


<pre>
 BronKerbosch3(G)
       BronKerbosch2({6}, {4}, Ø)
           BronKerbosch2({6,4}, Ø, Ø): output {6,4}
       BronKerbosch2({4}, {3,5}, {6})
           BronKerbosch2({4,3}, Ø, Ø): output {4,3}
           BronKerbosch2({4,5}, Ø, Ø): output {4,5}
       BronKerbosch2({3}, {2}, {4})
           BronKerbosch2({3,2}, Ø, Ø): output {3,2}
       BronKerbosch2({1}, {2,5}, Ø)
           BronKerbosch2({1,2}, {5}, Ø)
               BronKerbosch2({1,2,5}, Ø, Ø): output {1,2,5}
       BronKerbosch2({2}, {5}, {1,3}): no output
       BronKerbosch2({5}, Ø, {1,2,4}): no output
</pre>
<p>
Source: <a href="http://en.wikipedia.org/wiki/Bron–Kerbosch_algorithm#Example">http://en.wikipedia.org/wiki/Bron–Kerbosch_algorithm#Example</a>
</p>

<p>
I constructed the graph (found under doc/wiki.net) and ran it through my implementation of the Bron-Kerbosch algorithm and it results in the same cliques that the that is reported.  Therefore I believe my implementation of the Bron-Kerbosch clique-detection is suitable for use in Palla et al's k-clique detection algorithm. 
</p>


<pre>
Communities found with implementation of Bron-Kerbosch algorithm:
[1, 2]
[4, 3]
[1, 0, 4]
[3, 2]
\[3, 5]
</pre>
<p>
Output of minimum CommunityDetection.find(2):
</p>


<pre>
Bridges: 
     vertex    # Communities it belongs to

Amount communities found: 5
id   size
1:   3  deg(1) = 3
2:   2  deg(1) = 3
3:   2  deg(4) = 3
4:   2  deg(3) = 3
5:   2  deg(3) = 3

Bridges: 
     vertex    #Communities it belongs to
0:    3         3
1:    1         2
2:    4         2
3:    2         2
4:    0         1
5:    5         1

Community Statistics
 Size of Community     #of communities of this size
   3                       1
   2                       4
</pre>

<p>
In terms of communities this would mean that there is only one community of size 3, which is apparent in the image provided by wikipedia.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Results </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Karate.net </h3>
<div class="outline-text-3" id="text-2.1">




<pre>
Amount communities found: 25
id   size
1:   5  deg(25) = 16
2:   5  deg(25) = 16
3:   4  deg(28) = 17
4:   4  deg(28) = 17
5:   3  deg(28) = 17
6:   3  deg(28) = 17
7:   3  deg(25) = 16
8:   3  deg(25) = 16
9:   3  deg(2) = 4
10:   3  deg(25) = 16
11:   3  deg(28) = 17
12:   3  deg(25) = 16
13:   3  deg(26) = 12
14:   3  deg(28) = 17
15:   3  deg(28) = 17
16:   3  deg(25) = 16
17:   3  deg(25) = 16
18:   3  deg(28) = 17
19:   3  deg(28) = 17
20:   3  deg(25) = 16

Bridges: 
     vertex    # Communities it belongs to
0:              25         11
1:              28         11
2:              26         9
3:              24         5
4:              23         4
5:              12         3
6:              15         3
7:              2          3
8:              7          3
9:              22         3
10:             20         2
11:             8          2
12:             31         2
13:             1          2
14:             16         1
15:             30         1
16:             14         1
17:             3          1
18:             13         1
19:             11         1

Community Statistics
 Size           #of communities of this size
5               2
4               2
3               21
</pre>

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> c-elegans.net </h3>
<div class="outline-text-3" id="text-2.2">




<pre>
Amount communities found: 25
id   size
1:   5  deg(25) = 16
2:   5  deg(25) = 16
3:   4  deg(28) = 17
4:   4  deg(28) = 17
5:   3  deg(25) = 16
6:   3  deg(28) = 17
7:   3  deg(25) = 16
8:   3  deg(28) = 17
9:   3  deg(2) = 4
10:   3  deg(26) = 12
11:   3  deg(12) = 6
12:   3  deg(28) = 17
13:   3  deg(25) = 16
14:   3  deg(28) = 17
15:   3  deg(25) = 16
16:   3  deg(25) = 16
17:   3  deg(25) = 16
18:   3  deg(28) = 17
19:   3  deg(25) = 16
20:   3  deg(25) = 16

Bridges: 
     vertex    # Communities it belongs to
0:              28         11
1:              25         11
2:              26         9
3:              24         5
4:              23         4
5:              15         3
6:              12         3
7:              2         3
8:              22         3
9:              7         3
10:             8         2
11:             1         2
12:             31         2
13:             20         2
14:             19         1
15:             13         1
16:             32         1
17:             4         1
18:             14         1
19:             10         1

Community Statistics
 Size           #of communities of this size
5               2
4               2
3               21
</pre>

</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Artificial-00-mixing.net </h3>
<div class="outline-text-3" id="text-2.3">


<pre>
Graph<doc/artificial-00-mixing.net>|V|:  1000|E|: 7578
Degree Distribution:     minimum         average         maximum
  inDegree(v):            0     7.578000        48
  outDegree(v):           0     7.579000        46

Amount communities found: 2043
id   size
1:   21  deg(424) = 49
2:   21  deg(424) = 49
3:   19  deg(206) = 50
4:   19  deg(206) = 50
5:   18  deg(206) = 50
6:   18  deg(206) = 50
7:   18  deg(206) = 50
8:   18  deg(206) = 50
9:   17  deg(424) = 49
10:   17  deg(206) = 50
11:   17  deg(190) = 47
12:   17  deg(190) = 47
13:   17  deg(190) = 47
14:   17  deg(190) = 47
15:   17  deg(190) = 47
16:   17  deg(190) = 47
17:   17  deg(190) = 47
18:   17  deg(190) = 47
19:   17  deg(190) = 47
20:   17  deg(190) = 47

Bridges: 
       vertex    # Communities it belongs to
0:      482         160
1:      481         148
2:      478         138
3:      580         115
4:      47         113
5:      54         109
6:      246         99
7:      146         96
8:      159         94
9:      480         91
10:     48         89
11:     83         80
12:     106         79
13:     215         78
14:     74         77
15:     464         76
16:     582         76
17:     606         75
18:     149         75
19:     574         74

Community Statistics
 Size           #of communities of this size
21              2
19              2
18              4
17              24
16              10
15              13
14              15
13              21
12              30
11              57
10              128
9               172
8               213
7               287
6               390
5               399
4               211
3               65
</pre>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Russellvea
<a href="mailto:veas@veas-ThinkPad-X220">&lt;veas@veas-ThinkPad-X220&gt;</a>
</p>
<p class="date"> Date: 2011-12-15 10:04:14 HST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
